# sorting data

df.sort_values(by = "Column_name", ascending=True/False, inplace = True)

if want to sort in ascending order than true else if in descending then false

In [9]:
import pandas as pd

In [10]:
data = {
    "Name": ["Amit", "Sita", "Raj", "Priya", "Vikram", "Anjali", "Rohan", "Kiran", "Meera"],
    "Age": [25, 30, 28, 35, 40, 29, 32, 26, 31],
    "Salary": [50000, 60000, 55000, 75000, 80000, 52000, 70000, 48000, 65000],
    "Performance": ["Good", "Excellent", "Average", "Excellent", "Good", "Average", "Good", "Poor", "Excellent"]
}

In [11]:
df = pd.DataFrame( data )

In [12]:
df

     Name  Age  Salary Performance
0    Amit   25   50000        Good
1    Sita   30   60000   Excellent
2     Raj   28   55000     Average
3   Priya   35   75000   Excellent
4  Vikram   40   80000        Good
5  Anjali   29   52000     Average
6   Rohan   32   70000        Good
7   Kiran   26   48000        Poor
8   Meera   31   65000   Excellent

In [13]:
df.sort_values(by="Age", ascending=True , inplace=True)

In [14]:
df

     Name  Age  Salary Performance
0    Amit   25   50000        Good
7   Kiran   26   48000        Poor
2     Raj   28   55000     Average
5  Anjali   29   52000     Average
1    Sita   30   60000   Excellent
8   Meera   31   65000   Excellent
6   Rohan   32   70000        Good
3   Priya   35   75000   Excellent
4  Vikram   40   80000        Good